## Handling Missing Value

- Dropping Columns
- Dropping Rows
- Various Parameter in Dropping Functionalities
- handling Missing by Mean

In [ ]:
! pip install pyspark

In [ ]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('Practice').getOrCreate()
spark

In [ ]:
df = spark.read.csv('practice 3.csv',sep=';', header=True, inferSchema=True)
df.show()

+------+---+----------+------+
|  Name|Age|Experience|Salary|
+------+---+----------+------+
|  Dian| 12|         3| 40000|
|  Awan| 31|         4| 12000|
|  Ayen| 41|         1| 20200|
| Aksal| 73|         3|  2100|
|renita| 23|      NULL|   520|
|  NULL| 22|         3|  2321|
|  NULL| 13|      NULL| 29012|
+------+---+----------+------+

In [ ]:
# Drop the columns
df.drop('Name').show()

+---+----------+------+
|Age|Experience|Salary|
+---+----------+------+
| 12|         3| 40000|
| 31|         4| 12000|
| 41|         1| 20200|
| 73|         3|  2100|
| 23|      NULL|   520|
| 22|         3|  2321|
| 13|      NULL| 29012|
+---+----------+------+

In [ ]:
# drop row missing value
df.na.drop().show()

+-----+---+----------+------+
| Name|Age|Experience|Salary|
+-----+---+----------+------+
| Dian| 12|         3| 40000|
| Awan| 31|         4| 12000|
| Ayen| 41|         1| 20200|
|Aksal| 73|         3|  2100|
+-----+---+----------+------+

Parameters
how : str, optional
    'any' or 'all'. If 'any', drop a row if it contains any nulls. If 'all', drop a row only if all its values are null.

In [ ]:
# drop use how='any'
df.na.drop(how='any').show()

+-----+---+----------+------+
| Name|Age|Experience|Salary|
+-----+---+----------+------+
| Dian| 12|         3| 40000|
| Awan| 31|         4| 12000|
| Ayen| 41|         1| 20200|
|Aksal| 73|         3|  2100|
+-----+---+----------+------+

In [ ]:
# drop use how='all'
df.na.drop(how='all').show()

+------+---+----------+------+
|  Name|Age|Experience|Salary|
+------+---+----------+------+
|  Dian| 12|         3| 40000|
|  Awan| 31|         4| 12000|
|  Ayen| 41|         1| 20200|
| Aksal| 73|         3|  2100|
|renita| 23|      NULL|   520|
|  NULL| 22|         3|  2321|
|  NULL| 13|      NULL| 29012|
+------+---+----------+------+

In [ ]:
# parameter threshold
# delete null value with condition min non missing value
df.na.drop(how='any', thresh=3).show()
print('the last row is deleted because the min non missing value is 3, while in the last row they are only 2 non value ')

+------+---+----------+------+
|  Name|Age|Experience|Salary|
+------+---+----------+------+
|  Dian| 12|         3| 40000|
|  Awan| 31|         4| 12000|
|  Ayen| 41|         1| 20200|
| Aksal| 73|         3|  2100|
|renita| 23|      NULL|   520|
|  NULL| 22|         3|  2321|
+------+---+----------+------+

the last row is deleted because min non missing value is 3, while in last row they just have 2 non value

In [ ]:
# parameter subset
# delete null value in a specific columns
df.na.drop(how='any', subset=['Experience']).show()

+-----+---+----------+------+
| Name|Age|Experience|Salary|
+-----+---+----------+------+
| Dian| 12|         3| 40000|
| Awan| 31|         4| 12000|
| Ayen| 41|         1| 20200|
|Aksal| 73|         3|  2100|
| NULL| 22|         3|  2321|
+-----+---+----------+------+

In [ ]:
df.na.drop(how='any', subset=['Name']).show()

+------+---+----------+------+
|  Name|Age|Experience|Salary|
+------+---+----------+------+
|  Dian| 12|         3| 40000|
|  Awan| 31|         4| 12000|
|  Ayen| 41|         1| 20200|
| Aksal| 73|         3|  2100|
|renita| 23|      NULL|   520|
+------+---+----------+------+

In [ ]:
# Filling the Missing Value
df.na.fill('Missing Values').show()

+--------------+---+----------+------+
|          Name|Age|Experience|Salary|
+--------------+---+----------+------+
|          Dian| 12|         3| 40000|
|          Awan| 31|         4| 12000|
|          Ayen| 41|         1| 20200|
|         Aksal| 73|         3|  2100|
|        renita| 23|      NULL|   520|
|Missing Values| 22|         3|  2321|
|Missing Values| 13|      NULL| 29012|
+--------------+---+----------+------+

In [ ]:
# Filling the Missing Value in specific columns
df.na.fill('Missing Values',['Experience','Age']).show()

+------+---+----------+------+
|  Name|Age|Experience|Salary|
+------+---+----------+------+
|  Dian| 12|         3| 40000|
|  Awan| 31|         4| 12000|
|  Ayen| 41|         1| 20200|
| Aksal| 73|         3|  2100|
|renita| 23|      NULL|   520|
|  NULL| 22|         3|  2321|
|  NULL| 13|      NULL| 29012|
+------+---+----------+------+

In [ ]:
# Filling the Missing Value with mean
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols = ['Age','Experience','Salary'],
    outputCols = ['{}_imputed mean'.format(c) for c in ['Age','Experience','Salary']]
).setStrategy('mean')

In [ ]:
# add imputation cols to df
imputer.fit(df).transform(df).show()

+------+---+----------+------+----------------+-----------------------+-------------------+
|  Name|Age|Experience|Salary|Age_imputed mean|Experience_imputed mean|Salary_imputed mean|
+------+---+----------+------+----------------+-----------------------+-------------------+
|  Dian| 12|         3| 40000|              12|                      3|              40000|
|  Awan| 31|         4| 12000|              31|                      4|              12000|
|  Ayen| 41|         1| 20200|              41|                      1|              20200|
| Aksal| 73|         3|  2100|              73|                      3|               2100|
|renita| 23|      NULL|   520|              23|                      2|                520|
|  NULL| 22|         3|  2321|              22|                      3|               2321|
|  NULL| 13|      NULL| 29012|              13|                      2|              29012|
+------+---+----------+------+----------------+-----------------------+-------------------+

In [ ]:
# Filling the Missing Value with median
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols = ['Age','Experience','Salary'],
    outputCols = ['{}_imputed median'.format(c) for c in ['Age','Experience','Salary']]
).setStrategy('median')

In [ ]:
# add imputation cols to df
imputer.fit(df).transform(df).show()

+------+---+----------+------+------------------+-------------------------+---------------------+
|  Name|Age|Experience|Salary|Age_imputed median|Experience_imputed median|Salary_imputed median|
+------+---+----------+------+------------------+-------------------------+---------------------+
|  Dian| 12|         3| 40000|                12|                        3|                40000|
|  Awan| 31|         4| 12000|                31|                        4|                12000|
|  Ayen| 41|         1| 20200|                41|                        1|                20200|
| Aksal| 73|         3|  2100|                73|                        3|                 2100|
|renita| 23|      NULL|   520|                23|                        3|                  520|
|  NULL| 22|         3|  2321|                22|                        3|                 2321|
|  NULL| 13|      NULL| 29012|                13|                        3|                29012|
+------+---+----------+------+------------------+-------------------------+---------------------+